In [98]:
import pandas as pd

In [99]:
movies_data = pd.read_csv('data/ratings.csv')

# 1

In [100]:
def categorize(rating):
    if rating < 2:
        return 'низкий рейтинг'
    elif rating <= 4:
        return 'средний рейтинг'
    else:
        return 'высокий рейтинг'

In [101]:
movies_data['class'] = movies_data['rating'].apply(categorize)

In [102]:
movies_data

        userId  movieId  rating   timestamp            class
0            1        1     4.0   964982703  средний рейтинг
1            1        3     4.0   964981247  средний рейтинг
2            1        6     4.0   964982224  средний рейтинг
3            1       47     5.0   964983815  высокий рейтинг
4            1       50     5.0   964982931  высокий рейтинг
...        ...      ...     ...         ...              ...
100831     610   166534     4.0  1493848402  средний рейтинг
100832     610   168248     5.0  1493850091  высокий рейтинг
100833     610   168250     5.0  1494273047  высокий рейтинг
100834     610   168252     5.0  1493846352  высокий рейтинг
100835     610   170875     3.0  1493846415  средний рейтинг

[100836 rows x 5 columns]

# 2

In [103]:
keywords_data = pd.read_csv('data/keywords.csv')

In [104]:
keywords_data

                       keyword     shows
0                           вк  64292779
1                одноклассники  63810309
2                        порно  41747114
3                         ютуб  39995567
4                    вконтакте  21014195
...                        ...       ...
99995   эльдорадо старый оскол      3705
99996      frigate для firefox      3630
99997                   укрсиб      3630
99998  погода в ялте на неделю      3688
99999                     ггму      3630

[100000 rows x 2 columns]

In [105]:
geo_data = {

'Центр': ['москва', 'тула', 'ярославль'],

'Северо-Запад': ['петербург', 'псков', 'мурманск'],

'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']
    
}

In [106]:
def geo_classifier(keyword):
    for key, values in geo_data.items():
        if keyword in values:
            return key

In [107]:
keywords_data['region']= keywords_data['keyword'].apply(geo_classifier)

# 3

In [127]:
movies_data = pd.read_csv('data/ratings.csv')

In [128]:
movies_data

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [129]:
years = range(1950, 2011)

In [130]:
from datetime import datetime

In [131]:
def production_year(timestamp):
        time = datetime.fromtimestamp(timestamp) 
        year = time.year
        if year in years: 
            return year
        else:
            return 1900

In [132]:
movies_data['timestamp']

0          964982703
1          964981247
2          964982224
3          964983815
4          964982931
             ...
100831    1493848402
100832    1493850091
100833    1494273047
100834    1493846352
100835    1493846415
Name: timestamp, Length: 100836, dtype: int64

In [133]:
movies_data['timestamp'] = pd.to_numeric(movies_data['timestamp'].values)

In [134]:
movies_data['timestamp']

0          964982703
1          964981247
2          964982224
3          964983815
4          964982931
             ...
100831    1493848402
100832    1493850091
100833    1494273047
100834    1493846352
100835    1493846415
Name: timestamp, Length: 100836, dtype: int64

In [135]:
movies_data['year'] = movies_data['timestamp'].apply(production_year)

In [146]:
movies_data['year'].value_counts()

1900    37384
2000    10061
2007     7114
1996     6040
2005     5813
2008     4351
2009     4158
2006     4059
2003     4014
2001     3922
2002     3478
2004     3279
1999     2439
2010     2301
1997     1916
1998      507
Name: year, dtype: int64

In [153]:
movies_data.groupby('year').mean().sort_values('rating').reset_index()[['year', 'rating']]

    year    rating
0   2007  3.309039
1   2009  3.392496
2   2000  3.392506
3   2005  3.431533
4   1998  3.435897
5   2010  3.463494
6   2006  3.487928
7   2003  3.499377
8   2004  3.506099
9   2001  3.512239
10  1900  3.531310
11  1996  3.535927
12  2002  3.606958
13  2008  3.656746
14  1997  3.727557
15  1999  3.772448